InformationRegisters/ПорядокОтраженияНаСчетахУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ПорядокОтраженияНаСчетахУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСчетовРеглУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НастройкаСчетовУчетаАналитикаУчета</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НастройкаСчетовУчетаМестоУчета</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПорядокОтраженияНаСчетахУчета/Forms/ФормаЗаписиДинамически/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Запись, ЭтотОбъект);
	
	Если Параметры.Свойство("ВозвратЗначенияБезЗаписи") Тогда
		ВозвратЗначенияБезЗаписи = Параметры.ВозвратЗначенияБезЗаписи;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоУказаниеСчетов") Тогда
		ТолькоУказаниеСчетов = Параметры.ТолькоУказаниеСчетов;
	КонецЕсли;
	
	Если Параметры.Свойство("ЭтоНовый") Тогда
		НоваяЗапись = Параметры.ЭтоНовый;
	КонецЕсли;
	
	КэшДанныхМеханизмов = Новый Структура;
	АналитикаУчетаПараметр = Неопределено;
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		Параметры.ЗначенияЗаполнения.Свойство("АналитикаУчета", АналитикаУчетаПараметр);
	КонецЕсли;
	
	Если Параметры.Свойство("НастройкаСчетовУчета") Тогда
		ПараметрыНастройкиСчетовУчета = Параметры.НастройкаСчетовУчета;    
	ИначеЕсли АналитикаУчетаПараметр <> Неопределено Или Параметры.Свойство("РазделыУчета") Тогда
		Если АналитикаУчетаПараметр <> Неопределено Тогда
			РазделыУчетаПоАналитикеУчета = РегистрыСведений.ПорядокОтраженияНаСчетахУчета.РазделыУчетаПоАналитикеУчета(АналитикаУчетаПараметр);
		Иначе
			РазделыУчетаПоАналитикеУчета = ОбщегоНазначенияКлиентСервер.ОтмеченныеЭлементы(РегистрыСведений.ПорядокОтраженияНаСчетахУчета.СписокРазделовСчетовУчета());
		КонецЕсли;
		РазделыУчета = ?(Параметры.Свойство("РазделыУчета") И Параметры.РазделыУчета.Количество() < РазделыУчетаПоАналитикеУчета.Количество(), Параметры.РазделыУчета, РазделыУчетаПоАналитикеУчета);
		ПараметрыНастройкиСчетовУчета = НастройкаСчетовУчета.ПараметрыНастройкиСчетовУчета(РазделыУчета);
	Иначе
		ПараметрыНастройкиСчетовУчета = НастройкаСчетовУчета.ПараметрыНастройкиСчетовУчета();
	КонецЕсли;
	УточнитьПараметрыНастройкиСчетовДляТекущейФормы(ПараметрыНастройкиСчетовУчета);
	ОбщегоНазначенияУТ.СохранитьДанныеМеханизмаВКэшФормы(ЭтотОбъект, "НастройкаСчетовУчета", ПараметрыНастройкиСчетовУчета);
	
	НастройкаСчетовУчета.ЗаполнениеРеквизитовФормы(ЭтотОбъект);
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(Запись, Параметры.ЗначенияЗаполнения);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	КлючСохраненияПоложенияОкна = КэшДанныхМеханизмов.НастройкаСчетовУчета.СписокРазделовУчета.Получить(0).Значение;
	
	Если ЗначениеЗаполнено(Запись.АналитикаУчета) Тогда
		ПереопределитьФормуПоАналитикеУчета();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.АналитикаУчета) Тогда
		НастройкаСчетовУчета.ЗаполнитьРеквизитыНастройкиСчетовУчетаПоДаннымАналитики(ПараметрыНастройкиСчетовУчета, Запись.АналитикаУчета);
	ИначеЕсли Не ТолькоУказаниеСчетов Тогда
		Для каждого Реквизит Из ПараметрыНастройкиСчетовУчета.РеквизитыАналитики Цикл
			Если СтрНачинаетсяС(Реквизит.Ключ, "СчетУчета") Тогда
				ИмяРеквизита = НастройкаСчетовУчетаКлиентСервер.ИмяРеквизитаНаФорме(ПараметрыНастройкиСчетовУчета, , СтрЗаменить(Реквизит.Ключ, "СчетУчета_", ""));
				ПараметрыНастройкиСчетовУчета.РеквизитыАналитики.Вставить(Реквизит.Ключ, ЭтотОбъект[ИмяРеквизита]);
			КонецЕсли;
			Если СтрНачинаетсяС(Реквизит.Ключ, "Субконто") Тогда
				ИмяРеквизита = НастройкаСчетовУчетаКлиентСервер.ИмяРеквизитаНаФорме(ПараметрыНастройкиСчетовУчета, , СтрЗаменить(Реквизит.Ключ, "Субконто_", ""), "Субконто");
				ПараметрыНастройкиСчетовУчета.РеквизитыАналитики.Вставить(Реквизит.Ключ, ЭтотОбъект[ИмяРеквизита]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Элементы.АналитикаУчета.ТолькоПросмотр = ЗначениеЗаполнено(Запись.АналитикаУчета);
	Элементы.Организация.ТолькоПросмотр = ЗначениеЗаполнено(Запись.Организация);
	Элементы.МестоУчета.ТолькоПросмотр = ЗначениеЗаполнено(Запись.МестоУчета);
	
	НастройкаСчетовУчета.УстановитьНастройкиСчетовУчетаВФорме(ЭтотОбъект);
	
	Элементы.ГруппаИзмерения.Видимость = Не ТолькоУказаниеСчетов;
	
	РазделыУчетаСтрокой = НастройкаСчетовУчетаКлиентСервер.ЗаголовокПоРазделамУчета(КэшДанныхМеханизмов.НастройкаСчетовУчета.СписокРазделовУчета);
	Если ТолькоУказаниеСчетов Тогда
		ЭтотОбъект.АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru='Настройка отражения оперативных документов в регл. учете';uk='Настройка відображення оперативних документів в регл. обліку'");
	Иначе
		МассивЗаголовка = Новый Массив;
		МассивЗаголовка.Добавить(НСтр("ru='Порядок отражения на счетах учета';uk='Порядок відображення на рахунках обліку'"));
		Если ЗначениеЗаполнено(РазделыУчетаСтрокой) Тогда
			МассивЗаголовка.Добавить(РазделыУчетаСтрокой);
		КонецЕсли;
		Если НоваяЗапись Тогда
			МассивЗаголовка.Добавить(НСтр("ru='(создание)';uk='(створення)'"));
		КонецЕсли;
		Если МассивЗаголовка.Количество() > 1 Тогда
			ЭтотОбъект.АвтоЗаголовок = Ложь;
			Заголовок = СтрСоединить(МассивЗаголовка, " ");
		КонецЕсли;
	КонецЕсли;
	
	Если КэшДанныхМеханизмов.НастройкаСчетовУчета.СписокРазделовУчета.Количество() > 1 Тогда
		Элементы.РазделыУчета.Видимость = Истина;
	КонецЕсли;
	РазделыУчетаСтрокой = Новый ФорматированнаяСтрока(НастройкаСчетовУчетаКлиентСервер.ЗаголовокПоРазделамУчета(КэшДанныхМеханизмов.НастройкаСчетовУчета.СписокРазделовУчета),,,, "ОткрытьВыборРазделовУчета");
	НастройкаСчетовУчетаКлиентСервер.УстановитьВидимостьРаздела(ЭтотОбъект, КэшДанныхМеханизмов.НастройкаСчетовУчета.СписокРазделовУчета);
	
	Элементы.Организация.АвтоОтметкаНезаполненного = Не ЗначениеЗаполнено(Запись.АналитикаУчета) И НоваяЗапись;
	Если НоваяЗапись Тогда
		Элементы.Организация.ПодсказкаВвода = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Настройка = КэшДанныхМеханизмов.НастройкаСчетовУчета;
	СтруктураСчетовУчета = Новый Структура;
	Для каждого НастройкаРаздела Из Настройка.НастройкиРазделов Цикл
		
		НастройкаСчетовУчетаКлиентСервер.ЗаполнитьСчетаУчетаНастройкамиРаздела(НастройкаРаздела.Ключ, СтруктураСчетовУчета, Настройка, ЭтотОбъект);
		
	КонецЦикла;
	
	СтруктураИзмерений = НастройкаСчетовУчетаКлиентСервер.ИнициализироватьСтруктуруИзмеренийРегистра();
	ЗаполнитьЗначенияСвойств(СтруктураИзмерений, Запись);
	
	РегистрыСведений.ПорядокОтраженияНаСчетахУчета.СохранитьЗначенияСчетовУчета(СтруктураИзмерений, СтруктураСчетовУчета, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ТолькоУказаниеСчетов Тогда
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Не ВозвратЗначенияБезЗаписи И Не ТолькоУказаниеСчетов Тогда
		РедактируемыеРазделы = КэшДанныхМеханизмов.НастройкаСчетовУчета.СписокРазделовУчета;
		РедактируемыеРазделы = ОбщегоНазначенияКлиентСервер.ОтмеченныеЭлементы(РедактируемыеРазделы);
		Оповестить("ЗаконченаНастройкаСчетовУчета", РедактируемыеРазделы);
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Раздел = НастройкаСчетовУчетаКлиентСервер.РазделУчетаПоНастройкам(КэшДанныхМеханизмов.НастройкаСчетовУчета);
	НастройкиРаздела = КэшДанныхМеханизмов.НастройкаСчетовУчета.НастройкиРазделов.Получить(Раздел);
	НастройкиАналитикиУчета = НастройкиРаздела.СвойстваАналитики;
	Если Запись.АналитикаУчета = Неопределено И НастройкиАналитикиУчета.ТипЗначения <> Неопределено Тогда
		Запись.АналитикаУчета = НастройкиАналитикиУчета.ТипЗначения.ПривестиЗначение(Запись.АналитикаУчета);
	КонецЕсли;
	
	Если ВозвратЗначенияБезЗаписи Или ТолькоУказаниеСчетов Тогда
		
		Если Не ТолькоУказаниеСчетов Тогда
			Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
				Текст = НСтр("ru='Поле ""Организация"" не заполнено';uk='Поле ""Організація"" не заповнене'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, Параметры.Ключ, "Запись.Организация", "Запись.Организация", Отказ);
				Возврат;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Запись.АналитикаУчета) И НастройкиАналитикиУчета.Используется И НастройкиАналитикиУчета.ПредставлениеПустого = Неопределено Тогда
				Текст = НСтр("ru='Поле ""%1"" не заполнено';uk='Поле ""%1"" не заповнене'");
				Текст = СтрШаблон(Текст, НастройкиАналитикиУчета.Заголовок);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст, Параметры.Ключ, "Запись.АналитикаУчета", "Запись.АналитикаУчета", Отказ);
				Возврат;
			КонецЕсли;
			
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Отказ = Истина;
		Модифицированность = Ложь;
		
		Настройка = КэшДанныхМеханизмов.НастройкаСчетовУчета;
		Если ТолькоУказаниеСчетов Тогда
			СтруктураВозврата = Новый Структура;
		Иначе
			СтруктураВозврата = НастройкаСчетовУчетаКлиентСервер.ИнициализироватьСтруктуруИзмеренийРегистра();
			ЗаполнитьЗначенияСвойств(СтруктураВозврата, Запись);
			// Дополним структура реквизитами аналитики:
			Для каждого РеквизитАналитики Из Настройка.РеквизитыАналитики Цикл
				Если НастройкаСчетовУчетаКлиентСервер.ЭтоНеРеквизитАналитики(РеквизитАналитики.Ключ) Тогда
					Продолжить;
				КонецЕсли;
				СтруктураВозврата.Вставить(РеквизитАналитики.Ключ, РеквизитАналитики.Значение);
			КонецЦикла;
		КонецЕсли;
		Для каждого НастройкаРаздела Из Настройка.НастройкиРазделов Цикл
			НастройкаСчетовУчетаКлиентСервер.ЗаполнитьСчетаУчетаНастройкамиРаздела(НастройкаРаздела.Ключ, СтруктураВозврата, Настройка, ЭтотОбъект);
		КонецЦикла;
		
		Закрыть(СтруктураВозврата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьВыборРазделовУчета" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОграничиватьВыборУказаннымиЗначениями", Истина);
		ПараметрыФормы.Вставить("ОписаниеТипов", Новый ОписаниеТипов("Строка"));
		ПараметрыФормы.Вставить("ЗначенияДляВыбора", КэшДанныхМеханизмов.НастройкаСчетовУчета.СписокРазделовУчета);
		ПараметрыФормы.Вставить("Представление", НСтр("ru='Разделы учета для вывода';uk='Розділи обліку для виведення'"));
		СписокОтмеченных = Новый СписокЗначений;
		СписокОтмеченных.ЗагрузитьЗначения(ОбщегоНазначенияКлиентСервер.ОтмеченныеЭлементы(ПараметрыФормы.ЗначенияДляВыбора));
		ПараметрыФормы.Вставить("Отмеченные", СписокОтмеченных);
		ОповещениеОЗавершенииОтметки = Новый ОписаниеОповещения("УстановитьРазделыУчета", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.ВводЗначенийСпискомСФлажками", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор,,, ОповещениеОЗавершенииОтметки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ПриИзмененииСчетаУчета(Элемент)
	
	НастройкаСчетовУчетаКлиентСервер.УстановитьСвойстваЭлементовНастройкиСчетовУчета(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УточнитьПараметрыНастройкиСчетовДляТекущейФормы(ПараметрыНастройки)
	
	ПараметрыНастройки.ПрефиксЭлементовФормы = "";
	ПараметрыНастройки.ИмяГруппыНастроекСчетовУчета = "ГруппаСчетовУчета";
	ПараметрыНастройки.ПрефиксПутиКДанным = "";
	ПараметрыНастройки.ПрефиксПутиКДаннымРеквизитов = "Реквизит_";
	ПараметрыНастройки.РедактированиеВСписке = Ложь;
	ПараметрыНастройки.РазбитьПоРазделамЭлементы = ПараметрыНастройки.СписокРазделовУчета.Количество() > 1;
	ПараметрыНастройки.Вставить("МенятьОбщие");
	ПараметрыНастройки.СоздаватьВСлучаеОтсутствия = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПереопределитьФормуПоАналитикеУчета()
	
	ПараметрыНастройкиСчетовУчета = КэшДанныхМеханизмов.НастройкаСчетовУчета;
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Запись.АналитикаУчета);
	МенеджерОбъекта.ЗаполнитьСоответствиеРеквизитовНастройкиСчетовУчета(ПараметрыНастройкиСчетовУчета.ПутиКРеквизитамАналитики);
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРазделыУчета(СписокРазделовУчета, ДополнительныеПараметры = Неопределено) Экспорт

	Если СписокРазделовУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КэшДанныхМеханизмов.НастройкаСчетовУчета.СписокРазделовУчета = СписокРазделовУчета;
	РазделыУчетаСтрокой = Новый ФорматированнаяСтрока(НастройкаСчетовУчетаКлиентСервер.ЗаголовокПоРазделамУчета(КэшДанныхМеханизмов.НастройкаСчетовУчета.СписокРазделовУчета),,,, "ОткрытьВыборРазделовУчета");
	НастройкаСчетовУчетаКлиентСервер.УстановитьВидимостьРаздела(ЭтотОбъект, КэшДанныхМеханизмов.НастройкаСчетовУчета.СписокРазделовУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикаУчетаПриИзменении(Элемент)
	
	ПереопределитьФормуПоАналитикеУчета();
	НастройкаСчетовУчетаКлиентСервер.УстановитьСвойстваЭлементовНастройкиСчетовУчета(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
